// Lab15_2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

float func(float x) // функция и ее производная 2
{ 
 return(pow(cos(x), 3)); 
} 
float f1(float x) 
{ 
 return -3*pow(cos(x),2); 
} 

void main() // 1 метод 
{ 
 float x=1, s=0,n = 200, h, a = 1, b = 3; // задаем переменные 
 h = (b - a) / n; 
 for(x; x<=(b-h); x+=h) // пока x <= (b – h) выполняется цикл 
 { 
 s += h * func(x) + func(x+h) / 2; // формула
 } 
 printf("s = %f\n", s); 
} 

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
